<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"a579e5a6a574ff12ab59277cce3932e0bbdcc7cf6213a32852b06c8ac2b2fb5e","plan_job_ref":"Job Infrastructure #377 at https://github.com/coverage-robot/core/actions/runs/8161834222","plan_out_hash":"89b6d99aa0b8bd233246a0aa794d3a322247b56cefcc5f0d0905cc3ae467c496","plan_hash":"7cbe19ac541063af8fbb8e08b7f4bea219bfacb4dad3a38401f913f41e32e54a","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.events.aws_iam_policy.coverage_event_scheduler_policy will be created
+   resource "aws_iam_policy" "coverage_event_scheduler_policy" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "coverage-event-scheduler-policy-prod"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "events:PutEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:events:eu-west-2:952005856579:event-bus/coverage-events-prod",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.events.aws_iam_role_policy_attachment.coverage_event_scheduler_policy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "coverage_event_scheduler_policy_attachment" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "coverage-event-scheduler-role-prod"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Infrastructure #377](https://github.com/coverage-robot/core/actions/runs/8161834222)